[
  {
    "companyName": "Coalition Inc",
    "companyWebsite": "https://www.coalitioninc.com/",
    "position": "Software Engineer",
    "startDate": "June 2022",
    "description": [
      "Led migration from monolithic to microservices architecture, reducing document generation latency by 50% and improving system reliability to 99.99% SLO",
      "Architected and implemented policy validation service achieving 70% coverage, exceeding the quarterly target of 60%",
      "Collaborated with senior developers and a Principal Engineer to establish a comprehensive system observability strategy, enabling rapid debugging, reducing resolution times, and proactively resolving issues for enhanced customer experience and system reliability.",
      "Technologies Used: gRPC, GraphQL, React, Golang, Terraform, Terragrunt, Flask, FastAPI, Python, AWS ECS, Secrets Manager, S3, Docker, Redis"
    ]
  },
  {
    "companyName": "V! Studios",
    "companyWebsite": "https://www.v-studios.com/it-services.html",
    "position": "Software Engineer",
    "startDate": "Nov 2021",
    "endDate": "June 2022",
    "description": [
      "Collaborated on software projects for diverse government and commercial clients, delivering solutions tailored to their specific needs."
    ],
    "projects": [
      {
        "client": "NASA",
        "title": "Agency Level Portal Service (ALPS)",
        "details": [
          "Led the implementation of a centralized, cloud-native, scalable Agency-wide Library web portal.",
          "Significantly reduced redundancy across NASA sites, resulting in cost savings amounting to billions of dollars.",
          "Technologies Used: Wagtail (Django-based CMS), Python, AWS ClouldFormation, S3, RDS, EC2, SSM, Docker"
        ]
      },
      {
        "client": "NASA",
        "title": "images.nasa.gov (AVAIL)",
        "details": [
          "Maintained and expanded the images.nasa.gov website, contributing to its continued functionality and growth.",
          "Technologies Used: Pyramid, Python, AWS S3, RDS, EC2, SSM, Docker"
        ]
      }
    ]
  }
]
